quanhengwen/STM32F1xWorkSpace19/Examples/USB/Virtual_COM_Port/source/Virtual_COM_Port.c
	unsigned short	str_len=0;
	unsigned char		format_buffer[256]={0};
	
	//3)**********args为定义的一个指向可变参数的变量，va_list以及下边要用到的va_start,va_end都是是在定义，可变参数函数中必须要用到宏， 在stdarg.h头文件中定义
	va_list args;  
	//5)**********初始化args的函数，使其指向可变参数的第一个参数，format是可变参数的前一个参数
	va_start(args, format);
	//6)**********正常情况下返回生成字串的长度(除去\0),错误情况返回负值
	str_len = vsprintf((char*)format_buffer, format, args);
	//7)**********结束可变参数的获取
	va_end(args); 
	//8)**********将等发送缓冲区大小（数据个数）及缓冲区地址发给DMA开启发送	
	return api_usb_in_add_data((u8*)format_buffer,str_len);
	//return set_usart_tx_dma_buffer(USARTx,(u8*)format_buffer,str_len);		//串口DMA发送程序
}
/*******************************************************************************
*函数名			:	bq26100Verify
*功能描述		:	校验数据
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void bq26100Verify(void)
{
	
	unsigned short i = 0;
	static unsigned short time=0;
	static unsigned short start=0;
	static unsigned short serial=0;
	
	unsigned char* message=NULL;
	unsigned char* digest	=NULL;
	
	//启动等待时间
	if(start<2000)
	{
		start++;
		return;
	}
	//测试时间间隔
	if(time++<100)
		return ;
	time=0;
	
	if(serial>2500)
		return;
	
	if(0==serial)
		api_usb_printf("{\r\n");
	
	if(1==api_bq26100_Get_Digest(message,digest,serial))
	{
		api_usb_printf("%0.2d:\t",serial);
		api_usb_printf("{{");
		//-----------message
		for(i=0;i<19;i++)
		{
			api_usb_printf("%0.2X,",message[i]);
		}
		api_usb_printf("%0.2X",message[19]);
		
		api_usb_printf("},{");
		
		//-----------digest
		for(i=0;i<19;i++)
		{
			api_usb_printf("%0.2X,",digest[i]);
		}
		api_usb_printf("%0.2X",digest[19]);
		api_usb_printf("}},\r\n");			
		//api_usb_printf("%0.2X}",bq26100_sample_data2[serial][1][19]);
		api_usb_in_set_complete_end();
	}
	if(2500==serial)
		api_usb_printf("}");
	serial++;
}
/*******************************************************************************
*函数名			:	bq26100Verify
*功能描述		:	校验数据
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void bq26100GetDigest(void)
{
	
	unsigned short i = 0;
	static unsigned short time=0;
	static unsigned short start=0;
	static unsigned short serial=0;
	
	unsigned char* message=NULL;
	unsigned char* digest	=NULL;
	
	//启动等待时间
	if(start<2000)
	{
		start++;
		return;
	}
	//测试时间间隔
	if(time++<100)
		return ;
	time=0;
	
	if(serial>2500)
		return;
	
	if(0==serial)
		api_usb_printf("{\r\n");

	
	if(1==api_bq26100_data_Verify(message,digest,serial))
	{
		api_usb_printf("%0.2d:\t",serial);
		api_usb_printf("{{");
		//-----------message
		for(i=0;i<19;i++)
		{
			api_usb_printf("%0.2X,",message[i]);
		}
		api_usb_printf("%0.2X",message[19]);
		
		api_usb_printf("},{");
		
		//-----------digest
		for(i=0;i<19;i++)
		{
			api_usb_printf("%0.2X,",digest[i]);
		}
		api_usb_printf("%0.2X",digest[19]);
		api_usb_printf("}},\r\n");			
		api_usb_in_set_complete_end();
	}
	if(2500==serial)
		api_usb_printf("}");
	serial++;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned short usb_to_bq26100_server(void)
{
	unsigned short len	=	0;
	static unsigned char time=0;
	unsigned char buffer[USB_BUFFER_SIZE]={0};
	if(bDeviceState != CONFIGURED)
  {
		return 0;
	}
	if(0==get_usart_tx_idle(ComPort))		//串口状态检查
	{
		return 0;
	}
	//-----------------------------------无数据
	if(0!=api_usb_out_get_complete_flag())
	{
		return 0;
	}
	if(time++<10)		//连续帧间隔8ms
		return 0;
	time = 0;

	len	=	api_usb_out_get_data(buffer);
	if(20==len)
	{
		api_bq26100_set_message2(buffer);
		return len;
	}
	return 0;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void api_usb_virtual_gpio_configuration(void)
{
	GPIO_Configuration_OPP50(USB_DISCONNECT,USB_DISCONNECT_PIN);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605
	USB_CMD(DISABLE);
#if bq26100
	GPIO_Configuration_OPP50(G1Port,G1Pin);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605
	//GPIO_SetBits(G1Port,G1Pin);
	GPIO_ResetBits(G1Port,G1Pin);
	
	GPIO_Configuration_OPP50(G2Port,G2Pin);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605
	//GPIO_SetBits(G2Port,G2Pin);
	GPIO_ResetBits(G2Port,G2Pin);
	
	GPIO_Configuration_OPP50(G3Port,G3Pin);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605
	//GPIO_SetBits(G3Port,G3Pin);
	GPIO_ResetBits(G3Port,G3Pin);
	
	GPIO_Configuration_OPP50(V24Port,V24Pin);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605
	//GPIO_SetBits(V24Port,V24Pin);
	GPIO_ResetBits(V24Port,V24Pin);
	
	GPIO_Configuration_OPP50(V05Port,V05Pin);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605
	//GPIO_SetBits(V05Port,V05Pin);
	GPIO_ResetBits(V05Port,V05Pin);
	
	GPIO_Configuration_OPP50(MtxPort,MtxPin);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605
	//GPIO_SetBits(MtxPort,MtxPin);
	GPIO_ResetBits(MtxPort,MtxPin);
	
	GPIO_Configuration_OPP50(MrxPort,MrxPin);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605
	//GPIO_SetBits(MrxPort,MrxPin);
	GPIO_ResetBits(MrxPort,MrxPin);
	
#endif
}
//------------------------------------------------------------------------------



//------------------------------------------------------------------------------
/*******************************************************************************
* Function Name  : USB_Cable_Config
* Description    : Software Connection/Disconnection of USB Cable
* Input          : None.
* Return         : Status
*******************************************************************************/
void USB_CMD(FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
//    GPIO_ResetBits(USB_DISCONNECT, USB_DISCONNECT_PIN);
		GPIO_SetBits(USB_DISCONNECT, USB_DISCONNECT_PIN);
  }
  else
  {
//    GPIO_SetBits(USB_DISCONNECT, USB_DISCONNECT_PIN);
		GPIO_ResetBits(USB_DISCONNECT, USB_DISCONNECT_PIN);
  }
}
unsigned long sendnum=0;
unsigned long sendednum=0;

